{
    "title": "Boole Bots Game",
    "skills": [
        "HTML5",
        "CSS3",
        "JavaScript"
    ],
    "description": "Boole Bots is a game that is not only fun, but also an aid in helping to understand basic Boolean logic. This game has an arena of 8x8 game tiles in which your bots move at random speeds and trajectories. The Bots are assigned boolean values of 0 or 1 and boolean operations - AND, OR, NOR, NOT. When a bot collides with another bot its boolean operation is applied to both it and the other bots' boolean value to determine which one wins or looses, or if the collision results in a tie. Loosing bots disappear and winning bots continue moving about the arena until only one remains. ",
    "level": "hard",
    "credits": "florinpop17/app-ideas",
    "checklist": [
        "User can see the game window with these components",
        "- Game configuration input panel",
        "- Leaderboard showing bots ranked by their scores",
        "- Game controls",
        "- Arena of 8x8 game tiles where the bots battle",
        "User can see a log panel displaying the details of game milestones. Hint: This may be useful to the Developer during development and debugging.",
        "User can see a game clock displaying current elapsed game time that is updated every second.",
        "User may choose a bots starting direction as North, Northeast, Southeast, South, Southwest, West, or Northwest.",
        "User may specify the dimensions of the arena.",
        "User may select an unique icon for a bot from a palette of icons. Icons in the palette are disabled once they are assigned.",
        "User can see the bot with the most wins highlighted in some way in the Leaderboard.",
        "Developers may use graphics and game physics libraries to build the game."
    ],
    "help": [
        "N/a",
        "[George Boole (Wikipedia)](https://en.wikipedia.org/wiki/George_Boole)",
        "[Boolean Algebra (Wikipedia)](https://en.wikipedia.org/wiki/Boolean_algebra)",
        "[Video Game Physics Tutorial - Part I: An Introduction to Rigid Body Dynamics](https://www.toptal.com/game/video-game-physics-part-i-an-introduction-to-rigid-body-dynamics)"
    ]
}